#+STARTUP: overview
#+STARTUP: indent

* start a clean emacs
   #+BEGIN_SRC shell
   emacs -Q
   #+END_SRC

* locally force a mode inside a file
- see here [[http://emacs.stackexchange.com/a/26508/12585][emacs.stackexchange]]
- for example, put this on top of your shell file
  (but substitute for sh)
# -*- mode: org -*-
* change current directory
#+BEGIN_SRC emacs-lisp
M-x cd
#+END_SRC

* eshell
** to redirect the output of a command
#+BEGIN_SRC shell
echo hello >>> #<*scratch*>
echo hello >>> #<buffer *scratch*>
#+END_SRC

* info files
- scroll down: =C-e=
- scroll up: =C-y=
- page down: =SPC=
- page up: =DEL=
- node navigation: u(up), n(next), p(previous)
- link navigation. put cursor on next visible link: =TAB=
- vai pro começo da pagina atual do node: =b=

* Magit
- tranform a magit-diff buffer into a normal text buffer: `C-t`
* Ivy/Counsel
** turn on fuzzy matching
#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :ensure t
    :config
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (setq ivy-count-format "(%d/%d) ")
      (define-key ivy-minibuffer-map (kbd "<escape>") 'minibuffer-keyboard-quit)

      ;; use counsel
      (use-package counsel :ensure t)

      ;; here we have the option to turn on ivy fuzzy matching mode (and use `flx' package, if present)
      ;; * lifted from bling's and abo-abo's  comments from these urls: 
      ;;   - https://github.com/abo-abo/swiper/issues/154 
      ;;   - https://www.reddit.com/r/emacs/comments/3xzas3/help_with_ivycounsel_fuzzy_matching_and_sorting/cy9432y
      ;; * also se this post on oremacs.com (abo-abo's blog, the creator of ivy, counsel, hydra and avy):
      ;;   - http://oremacs.com/2016/01/06/ivy-flx/
      (setq ivy--regex-function 'ivy--regex-fuzzy)
      (setq ivy-re-builders-alist '((t . ivy--regex-fuzzy)))
      ;; use flx for fuzzy matching
      (use-package flx :ensure t)
  )
#+END_SRC

* org-mode tables
** exporting an org table to csv format
 #+name: foo

 | header A | header B |
 |----------+----------|
 | cell 1   | cell 2   |
 | cell 3   | cell 4   |
 
#+BEGIN_SRC elisp :var x=foo
(orgtbl-to-csv x nil)
#+END_SRC

#+RESULTS:
: header A,header B
: cell 1,cell 2
: cell 3,cell 4

** convert an org table to csv format
1. select the region
2. M-x replace-string
3. type |
4. C-q RET TAB (or ,) (or whatever)
5. profit!
** delete an entire org-table
- see [[https://www.reddit.com/r/emacs/comments/56oc9c/orgtables_is_there_a_way_to_delete_a_whole_table/][here]]
- select the top left bar (|) and issue M-x org-mark-element. then destroy the region as you see fit.
* Links, references
- [[https://medium.com/@bryangarza/my-descent-into-evil-98f7017475b6#.49n4guhq4][my descent into evil]]

